Tekla Open API Reference for Tekla Structures 2025
Phase Properties
The Phase type exposes the following members.
Properties
Name | Description
IsCurrentPhase
 The value is 1 if the phase is the current phase, 0 otherwise.
PhaseComment
 The phase comment.
PhaseName
 The phase name.
PhaseNumber
 The phase number.
Top
See Also
Reference
Phase Class
Tekla.Structures.Model Namespace